# PhasesAsCurrents Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..PhasesAsCurrents Property
PanelScheduleData Class See Also
---
If true, the phase columns are currents (A), otherwise they are loads (VA); setting this value must go through the appropriate update function
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool PhasesAsCurrents { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PhasesAsCurrents As Boolean
	Get
```

Visual C++
---
```text
public:
property bool PhasesAsCurrents {
	bool get ();
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace